{
 "index": 3,
 "link": "/work/next_level_fitness",
 "ProjectName": "Next Level Fitness",
 "ProjectDescription": "UI/UX Fitness Tracking Mobile App",
 "RoleDescription": "UI/UX Designer / Researcher / Product Design",
 "GoalDescription": "Reduce the treatment gap by providing educational tools for people with and without mental health struggles and treatment for people with mental health struggles.",
 "sections": [
  {
   "name": "Overview",
   "link": "overview",
   "Main": "People who live in cities struggle to find the perfect dog to adopt to their lack of unique needs, such as living spaces, schedule & transportation, outdoor space, and other city-specific criteria.",
   "Text": {
    "0": "CityPups is a new startup that wants to help people living in cities find the perfect dog to adopt.",
    "1": "People have not taken action because they do not feel confident that a dog will be a good fit for them AND the dog. Most adoption sites focus on making a connection between people and dogs. This is great for browsing, but it often leads to people falling in love with a dog that needs more space, attention, or activity than they can provide. This leads to disappointment and more indecision. Descriptions of dogs on sites are too general- for example, it may say “this dog doesn’t require a lot of space”- but how small is too small?",
    "2": "To give people confidence that they will be a great fit both in emotional connection and practical factors related to their lifestyle, CityPups wants to offer an extensive “Find your match” assessment consisting of multiple questions that will narrow down the search and provide dogs that align with their requirements."
   },
   "overview": {}
  },
  {
   "name": "Research",
   "link": "research",
   "research": {}
  },
  {
   "name": "Synthesis",
   "link": "synthesis",
   "synthesis": {}
  },
  {
   "name": "Ideation",
   "link": "ideation",
   "ideation": {}
  },
  {
   "name": "Implementation",
   "link": "implementation",
   "implementation": {}
  },
  {
   "name": "Conclusion",
   "link": "conclusion",
   "conclusion": {}
  }
 ]
}
